Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS506.h
#define _ADTRIG7_TRGSRC130_POSITION              0x00000008
#define _ADTRIG7_TRGSRC130_MASK                  0x00000100
#define _ADTRIG7_TRGSRC130_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC131_POSITION              0x00000009
#define _ADTRIG7_TRGSRC131_MASK                  0x00000200
#define _ADTRIG7_TRGSRC131_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC132_POSITION              0x0000000A
#define _ADTRIG7_TRGSRC132_MASK                  0x00000400
#define _ADTRIG7_TRGSRC132_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC133_POSITION              0x0000000B
#define _ADTRIG7_TRGSRC133_MASK                  0x00000800
#define _ADTRIG7_TRGSRC133_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC134_POSITION              0x0000000C
#define _ADTRIG7_TRGSRC134_MASK                  0x00001000
#define _ADTRIG7_TRGSRC134_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC14_POSITION               0x00000000
#define _ADTRIG8_TRGSRC14_MASK                   0x0000001F
#define _ADTRIG8_TRGSRC14_LENGTH                 0x00000005

#define _ADTRIG8_TRGSRC15_POSITION               0x00000008
#define _ADTRIG8_TRGSRC15_MASK                   0x00001F00
#define _ADTRIG8_TRGSRC15_LENGTH                 0x00000005

#define _ADTRIG8_TRGSRC140_POSITION              0x00000000
#define _ADTRIG8_TRGSRC140_MASK                  0x00000001
#define _ADTRIG8_TRGSRC140_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC141_POSITION              0x00000001
#define _ADTRIG8_TRGSRC141_MASK                  0x00000002
#define _ADTRIG8_TRGSRC141_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC142_POSITION              0x00000002
#define _ADTRIG8_TRGSRC142_MASK                  0x00000004
#define _ADTRIG8_TRGSRC142_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC143_POSITION              0x00000003
#define _ADTRIG8_TRGSRC143_MASK                  0x00000008
#define _ADTRIG8_TRGSRC143_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC144_POSITION              0x00000004
#define _ADTRIG8_TRGSRC144_MASK                  0x00000010
#define _ADTRIG8_TRGSRC144_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC150_POSITION              0x00000008
#define _ADTRIG8_TRGSRC150_MASK                  0x00000100
#define _ADTRIG8_TRGSRC150_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC151_POSITION              0x00000009
#define _ADTRIG8_TRGSRC151_MASK                  0x00000200
#define _ADTRIG8_TRGSRC151_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC152_POSITION              0x0000000A
#define _ADTRIG8_TRGSRC152_MASK                  0x00000400
#define _ADTRIG8_TRGSRC152_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC153_POSITION              0x0000000B
#define _ADTRIG8_TRGSRC153_MASK                  0x00000800
#define _ADTRIG8_TRGSRC153_LENGTH                0x00000001

#define _ADTRIG8_TRGSRC154_POSITION              0x0000000C
#define _ADTRIG8_TRGSRC154_MASK                  0x00001000
#define _ADTRIG8_TRGSRC154_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC16_POSITION               0x00000000
#define _ADTRIG9_TRGSRC16_MASK                   0x0000001F
#define _ADTRIG9_TRGSRC16_LENGTH                 0x00000005

#define _ADTRIG9_TRGSRC17_POSITION               0x00000008
#define _ADTRIG9_TRGSRC17_MASK                   0x00001F00
#define _ADTRIG9_TRGSRC17_LENGTH                 0x00000005

#define _ADTRIG9_TRGSRC160_POSITION              0x00000000
#define _ADTRIG9_TRGSRC160_MASK                  0x00000001
#define _ADTRIG9_TRGSRC160_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC161_POSITION              0x00000001
#define _ADTRIG9_TRGSRC161_MASK                  0x00000002
#define _ADTRIG9_TRGSRC161_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC162_POSITION              0x00000002
#define _ADTRIG9_TRGSRC162_MASK                  0x00000004
#define _ADTRIG9_TRGSRC162_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC163_POSITION              0x00000003
#define _ADTRIG9_TRGSRC163_MASK                  0x00000008
#define _ADTRIG9_TRGSRC163_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC164_POSITION              0x00000004
#define _ADTRIG9_TRGSRC164_MASK                  0x00000010
#define _ADTRIG9_TRGSRC164_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC170_POSITION              0x00000008
#define _ADTRIG9_TRGSRC170_MASK                  0x00000100
#define _ADTRIG9_TRGSRC170_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC171_POSITION              0x00000009
#define _ADTRIG9_TRGSRC171_MASK                  0x00000200
#define _ADTRIG9_TRGSRC171_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC172_POSITION              0x0000000A
#define _ADTRIG9_TRGSRC172_MASK                  0x00000400
#define _ADTRIG9_TRGSRC172_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC173_POSITION              0x0000000B
#define _ADTRIG9_TRGSRC173_MASK                  0x00000800
#define _ADTRIG9_TRGSRC173_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC174_POSITION              0x0000000C
#define _ADTRIG9_TRGSRC174_MASK                  0x00001000
#define _ADTRIG9_TRGSRC174_LENGTH                0x00000001

#define _ADTRIG10_TRGSRC18_POSITION              0x00000000
#define _ADTRIG10_TRGSRC18_MASK                  0x0000001F
#define _ADTRIG10_TRGSRC18_LENGTH                0x00000005

#define _ADTRIG10_TRGSRC19_POSITION              0x00000008
#define _ADTRIG10_TRGSRC19_MASK                  0x00001F00
#define _ADTRIG10_TRGSRC19_LENGTH                0x00000005

#define _ADTRIG10_TRGSRC180_POSITION             0x00000000
#define _ADTRIG10_TRGSRC180_MASK                 0x00000001
#define _ADTRIG10_TRGSRC180_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC181_POSITION             0x00000001
#define _ADTRIG10_TRGSRC181_MASK                 0x00000002
#define _ADTRIG10_TRGSRC181_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC182_POSITION             0x00000002
#define _ADTRIG10_TRGSRC182_MASK                 0x00000004
#define _ADTRIG10_TRGSRC182_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC183_POSITION             0x00000003
#define _ADTRIG10_TRGSRC183_MASK                 0x00000008
#define _ADTRIG10_TRGSRC183_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC184_POSITION             0x00000004
#define _ADTRIG10_TRGSRC184_MASK                 0x00000010
#define _ADTRIG10_TRGSRC184_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC190_POSITION             0x00000008
#define _ADTRIG10_TRGSRC190_MASK                 0x00000100
#define _ADTRIG10_TRGSRC190_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC191_POSITION             0x00000009
#define _ADTRIG10_TRGSRC191_MASK                 0x00000200
#define _ADTRIG10_TRGSRC191_LENGTH               0x00000001

