Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS506.h
#define _RPOR6_RP44R4_POSITION                   0x00000004
#define _RPOR6_RP44R4_MASK                       0x00000010
#define _RPOR6_RP44R4_LENGTH                     0x00000001

#define _RPOR6_RP44R5_POSITION                   0x00000005
#define _RPOR6_RP44R5_MASK                       0x00000020
#define _RPOR6_RP44R5_LENGTH                     0x00000001

#define _RPOR6_RP45R0_POSITION                   0x00000008
#define _RPOR6_RP45R0_MASK                       0x00000100
#define _RPOR6_RP45R0_LENGTH                     0x00000001

#define _RPOR6_RP45R1_POSITION                   0x00000009
#define _RPOR6_RP45R1_MASK                       0x00000200
#define _RPOR6_RP45R1_LENGTH                     0x00000001

#define _RPOR6_RP45R2_POSITION                   0x0000000A
#define _RPOR6_RP45R2_MASK                       0x00000400
#define _RPOR6_RP45R2_LENGTH                     0x00000001

#define _RPOR6_RP45R3_POSITION                   0x0000000B
#define _RPOR6_RP45R3_MASK                       0x00000800
#define _RPOR6_RP45R3_LENGTH                     0x00000001

#define _RPOR6_RP45R4_POSITION                   0x0000000C
#define _RPOR6_RP45R4_MASK                       0x00001000
#define _RPOR6_RP45R4_LENGTH                     0x00000001

#define _RPOR6_RP45R5_POSITION                   0x0000000D
#define _RPOR6_RP45R5_MASK                       0x00002000
#define _RPOR6_RP45R5_LENGTH                     0x00000001

#define _RPOR7_RP46R_POSITION                    0x00000000
#define _RPOR7_RP46R_MASK                        0x0000003F
#define _RPOR7_RP46R_LENGTH                      0x00000006

#define _RPOR7_RP47R_POSITION                    0x00000008
#define _RPOR7_RP47R_MASK                        0x00003F00
#define _RPOR7_RP47R_LENGTH                      0x00000006

#define _RPOR7_RP46R0_POSITION                   0x00000000
#define _RPOR7_RP46R0_MASK                       0x00000001
#define _RPOR7_RP46R0_LENGTH                     0x00000001

#define _RPOR7_RP46R1_POSITION                   0x00000001
#define _RPOR7_RP46R1_MASK                       0x00000002
#define _RPOR7_RP46R1_LENGTH                     0x00000001

#define _RPOR7_RP46R2_POSITION                   0x00000002
#define _RPOR7_RP46R2_MASK                       0x00000004
#define _RPOR7_RP46R2_LENGTH                     0x00000001

#define _RPOR7_RP46R3_POSITION                   0x00000003
#define _RPOR7_RP46R3_MASK                       0x00000008
#define _RPOR7_RP46R3_LENGTH                     0x00000001

#define _RPOR7_RP46R4_POSITION                   0x00000004
#define _RPOR7_RP46R4_MASK                       0x00000010
#define _RPOR7_RP46R4_LENGTH                     0x00000001

#define _RPOR7_RP46R5_POSITION                   0x00000005
#define _RPOR7_RP46R5_MASK                       0x00000020
#define _RPOR7_RP46R5_LENGTH                     0x00000001

#define _RPOR7_RP47R0_POSITION                   0x00000008
#define _RPOR7_RP47R0_MASK                       0x00000100
#define _RPOR7_RP47R0_LENGTH                     0x00000001

#define _RPOR7_RP47R1_POSITION                   0x00000009
#define _RPOR7_RP47R1_MASK                       0x00000200
#define _RPOR7_RP47R1_LENGTH                     0x00000001

#define _RPOR7_RP47R2_POSITION                   0x0000000A
#define _RPOR7_RP47R2_MASK                       0x00000400
#define _RPOR7_RP47R2_LENGTH                     0x00000001

#define _RPOR7_RP47R3_POSITION                   0x0000000B
#define _RPOR7_RP47R3_MASK                       0x00000800
#define _RPOR7_RP47R3_LENGTH                     0x00000001

#define _RPOR7_RP47R4_POSITION                   0x0000000C
#define _RPOR7_RP47R4_MASK                       0x00001000
#define _RPOR7_RP47R4_LENGTH                     0x00000001

#define _RPOR7_RP47R5_POSITION                   0x0000000D
#define _RPOR7_RP47R5_MASK                       0x00002000
#define _RPOR7_RP47R5_LENGTH                     0x00000001

#define _RPOR8_RP48R_POSITION                    0x00000000
#define _RPOR8_RP48R_MASK                        0x0000003F
#define _RPOR8_RP48R_LENGTH                      0x00000006

#define _RPOR8_RP49R_POSITION                    0x00000008
#define _RPOR8_RP49R_MASK                        0x00003F00
#define _RPOR8_RP49R_LENGTH                      0x00000006

#define _RPOR8_RP48R0_POSITION                   0x00000000
#define _RPOR8_RP48R0_MASK                       0x00000001
#define _RPOR8_RP48R0_LENGTH                     0x00000001

#define _RPOR8_RP48R1_POSITION                   0x00000001
#define _RPOR8_RP48R1_MASK                       0x00000002
#define _RPOR8_RP48R1_LENGTH                     0x00000001

#define _RPOR8_RP48R2_POSITION                   0x00000002
#define _RPOR8_RP48R2_MASK                       0x00000004
#define _RPOR8_RP48R2_LENGTH                     0x00000001

#define _RPOR8_RP48R3_POSITION                   0x00000003
#define _RPOR8_RP48R3_MASK                       0x00000008
#define _RPOR8_RP48R3_LENGTH                     0x00000001

#define _RPOR8_RP48R4_POSITION                   0x00000004
#define _RPOR8_RP48R4_MASK                       0x00000010
#define _RPOR8_RP48R4_LENGTH                     0x00000001

#define _RPOR8_RP48R5_POSITION                   0x00000005
#define _RPOR8_RP48R5_MASK                       0x00000020
#define _RPOR8_RP48R5_LENGTH                     0x00000001

#define _RPOR8_RP49R0_POSITION                   0x00000008
#define _RPOR8_RP49R0_MASK                       0x00000100
#define _RPOR8_RP49R0_LENGTH                     0x00000001

#define _RPOR8_RP49R1_POSITION                   0x00000009
#define _RPOR8_RP49R1_MASK                       0x00000200
#define _RPOR8_RP49R1_LENGTH                     0x00000001

#define _RPOR8_RP49R2_POSITION                   0x0000000A
#define _RPOR8_RP49R2_MASK                       0x00000400
#define _RPOR8_RP49R2_LENGTH                     0x00000001

#define _RPOR8_RP49R3_POSITION                   0x0000000B
#define _RPOR8_RP49R3_MASK                       0x00000800
#define _RPOR8_RP49R3_LENGTH                     0x00000001

#define _RPOR8_RP49R4_POSITION                   0x0000000C
#define _RPOR8_RP49R4_MASK                       0x00001000
#define _RPOR8_RP49R4_LENGTH                     0x00000001

#define _RPOR8_RP49R5_POSITION                   0x0000000D
#define _RPOR8_RP49R5_MASK                       0x00002000
#define _RPOR8_RP49R5_LENGTH                     0x00000001

#define _RPOR9_RP50R_POSITION                    0x00000000
#define _RPOR9_RP50R_MASK                        0x0000003F
#define _RPOR9_RP50R_LENGTH                      0x00000006

#define _RPOR9_RP51R_POSITION                    0x00000008
#define _RPOR9_RP51R_MASK                        0x00003F00
#define _RPOR9_RP51R_LENGTH                      0x00000006

#define _RPOR9_RP50R0_POSITION                   0x00000000
#define _RPOR9_RP50R0_MASK                       0x00000001
#define _RPOR9_RP50R0_LENGTH                     0x00000001

#define _RPOR9_RP50R1_POSITION                   0x00000001
#define _RPOR9_RP50R1_MASK                       0x00000002
#define _RPOR9_RP50R1_LENGTH                     0x00000001

