Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS506.h
#define _RPOR9_RP50R2_POSITION                   0x00000002
#define _RPOR9_RP50R2_MASK                       0x00000004
#define _RPOR9_RP50R2_LENGTH                     0x00000001

#define _RPOR9_RP50R3_POSITION                   0x00000003
#define _RPOR9_RP50R3_MASK                       0x00000008
#define _RPOR9_RP50R3_LENGTH                     0x00000001

#define _RPOR9_RP50R4_POSITION                   0x00000004
#define _RPOR9_RP50R4_MASK                       0x00000010
#define _RPOR9_RP50R4_LENGTH                     0x00000001

#define _RPOR9_RP50R5_POSITION                   0x00000005
#define _RPOR9_RP50R5_MASK                       0x00000020
#define _RPOR9_RP50R5_LENGTH                     0x00000001

#define _RPOR9_RP51R0_POSITION                   0x00000008
#define _RPOR9_RP51R0_MASK                       0x00000100
#define _RPOR9_RP51R0_LENGTH                     0x00000001

#define _RPOR9_RP51R1_POSITION                   0x00000009
#define _RPOR9_RP51R1_MASK                       0x00000200
#define _RPOR9_RP51R1_LENGTH                     0x00000001

#define _RPOR9_RP51R2_POSITION                   0x0000000A
#define _RPOR9_RP51R2_MASK                       0x00000400
#define _RPOR9_RP51R2_LENGTH                     0x00000001

#define _RPOR9_RP51R3_POSITION                   0x0000000B
#define _RPOR9_RP51R3_MASK                       0x00000800
#define _RPOR9_RP51R3_LENGTH                     0x00000001

#define _RPOR9_RP51R4_POSITION                   0x0000000C
#define _RPOR9_RP51R4_MASK                       0x00001000
#define _RPOR9_RP51R4_LENGTH                     0x00000001

#define _RPOR9_RP51R5_POSITION                   0x0000000D
#define _RPOR9_RP51R5_MASK                       0x00002000
#define _RPOR9_RP51R5_LENGTH                     0x00000001

#define _RPOR10_RP52R_POSITION                   0x00000000
#define _RPOR10_RP52R_MASK                       0x0000003F
#define _RPOR10_RP52R_LENGTH                     0x00000006

#define _RPOR10_RP53R_POSITION                   0x00000008
#define _RPOR10_RP53R_MASK                       0x00003F00
#define _RPOR10_RP53R_LENGTH                     0x00000006

#define _RPOR10_RP52R0_POSITION                  0x00000000
#define _RPOR10_RP52R0_MASK                      0x00000001
#define _RPOR10_RP52R0_LENGTH                    0x00000001

#define _RPOR10_RP52R1_POSITION                  0x00000001
#define _RPOR10_RP52R1_MASK                      0x00000002
#define _RPOR10_RP52R1_LENGTH                    0x00000001

#define _RPOR10_RP52R2_POSITION                  0x00000002
#define _RPOR10_RP52R2_MASK                      0x00000004
#define _RPOR10_RP52R2_LENGTH                    0x00000001

#define _RPOR10_RP52R3_POSITION                  0x00000003
#define _RPOR10_RP52R3_MASK                      0x00000008
#define _RPOR10_RP52R3_LENGTH                    0x00000001

#define _RPOR10_RP52R4_POSITION                  0x00000004
#define _RPOR10_RP52R4_MASK                      0x00000010
#define _RPOR10_RP52R4_LENGTH                    0x00000001

#define _RPOR10_RP52R5_POSITION                  0x00000005
#define _RPOR10_RP52R5_MASK                      0x00000020
#define _RPOR10_RP52R5_LENGTH                    0x00000001

#define _RPOR10_RP53R0_POSITION                  0x00000008
#define _RPOR10_RP53R0_MASK                      0x00000100
#define _RPOR10_RP53R0_LENGTH                    0x00000001

#define _RPOR10_RP53R1_POSITION                  0x00000009
#define _RPOR10_RP53R1_MASK                      0x00000200
#define _RPOR10_RP53R1_LENGTH                    0x00000001

#define _RPOR10_RP53R2_POSITION                  0x0000000A
#define _RPOR10_RP53R2_MASK                      0x00000400
#define _RPOR10_RP53R2_LENGTH                    0x00000001

#define _RPOR10_RP53R3_POSITION                  0x0000000B
#define _RPOR10_RP53R3_MASK                      0x00000800
#define _RPOR10_RP53R3_LENGTH                    0x00000001

#define _RPOR10_RP53R4_POSITION                  0x0000000C
#define _RPOR10_RP53R4_MASK                      0x00001000
#define _RPOR10_RP53R4_LENGTH                    0x00000001

#define _RPOR10_RP53R5_POSITION                  0x0000000D
#define _RPOR10_RP53R5_MASK                      0x00002000
#define _RPOR10_RP53R5_LENGTH                    0x00000001

#define _RPOR11_RP54R_POSITION                   0x00000000
#define _RPOR11_RP54R_MASK                       0x0000003F
#define _RPOR11_RP54R_LENGTH                     0x00000006

#define _RPOR11_RP55R_POSITION                   0x00000008
#define _RPOR11_RP55R_MASK                       0x00003F00
#define _RPOR11_RP55R_LENGTH                     0x00000006

#define _RPOR11_RP54R0_POSITION                  0x00000000
#define _RPOR11_RP54R0_MASK                      0x00000001
#define _RPOR11_RP54R0_LENGTH                    0x00000001

#define _RPOR11_RP54R1_POSITION                  0x00000001
#define _RPOR11_RP54R1_MASK                      0x00000002
#define _RPOR11_RP54R1_LENGTH                    0x00000001

#define _RPOR11_RP54R2_POSITION                  0x00000002
#define _RPOR11_RP54R2_MASK                      0x00000004
#define _RPOR11_RP54R2_LENGTH                    0x00000001

#define _RPOR11_RP54R3_POSITION                  0x00000003
#define _RPOR11_RP54R3_MASK                      0x00000008
#define _RPOR11_RP54R3_LENGTH                    0x00000001

#define _RPOR11_RP54R4_POSITION                  0x00000004
#define _RPOR11_RP54R4_MASK                      0x00000010
#define _RPOR11_RP54R4_LENGTH                    0x00000001

#define _RPOR11_RP54R5_POSITION                  0x00000005
#define _RPOR11_RP54R5_MASK                      0x00000020
#define _RPOR11_RP54R5_LENGTH                    0x00000001

#define _RPOR11_RP55R0_POSITION                  0x00000008
#define _RPOR11_RP55R0_MASK                      0x00000100
#define _RPOR11_RP55R0_LENGTH                    0x00000001

#define _RPOR11_RP55R1_POSITION                  0x00000009
#define _RPOR11_RP55R1_MASK                      0x00000200
#define _RPOR11_RP55R1_LENGTH                    0x00000001

#define _RPOR11_RP55R2_POSITION                  0x0000000A
#define _RPOR11_RP55R2_MASK                      0x00000400
#define _RPOR11_RP55R2_LENGTH                    0x00000001

#define _RPOR11_RP55R3_POSITION                  0x0000000B
#define _RPOR11_RP55R3_MASK                      0x00000800
#define _RPOR11_RP55R3_LENGTH                    0x00000001

#define _RPOR11_RP55R4_POSITION                  0x0000000C
#define _RPOR11_RP55R4_MASK                      0x00001000
#define _RPOR11_RP55R4_LENGTH                    0x00000001

#define _RPOR11_RP55R5_POSITION                  0x0000000D
#define _RPOR11_RP55R5_MASK                      0x00002000
#define _RPOR11_RP55R5_LENGTH                    0x00000001

#define _RPOR12_RP56R_POSITION                   0x00000000
#define _RPOR12_RP56R_MASK                       0x0000003F
#define _RPOR12_RP56R_LENGTH                     0x00000006

